#ifndef __circle__
#define __circle__

//------------------------------------------------------------------------------
// circle.h - содержит описание круга
//------------------------------------------------------------------------------

#include <fstream>
using namespace std;

# include "rnd.h"

//------------------------------------------------------------------------------
// круг
struct circle {
    int x, y; // координаты центра
    int r; // радиус
};

// Ввод параметров круга из файла
void In(circle &c, ifstream &ifst);

// Случайный ввод параметров круга
void InRnd(circle &c);

// Вывод параметров круга в форматируемый поток
void Out(circle &c, ofstream &ofst);

// Вычисление периметра круга
double Perimeter(circle &c);

#endif //__circle__
