//------------------------------------------------------------------------------
// circle.cpp - содержит методы круга
//------------------------------------------------------------------------------

#include "circle.h"
#include "math.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void Circle::In(ifstream &ifst) {
    ifst >> x >> y >> r;
}

// Случайный ввод параметров прямоугольника
void Circle::InRnd() {
    x = Shape::rnd20.Get();
    y = Shape::rnd20.Get();
    r = Shape::rnd20.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Circle::Out(ofstream &ofst) {
    ofst << "It is Circle: x = "
         << x << ", y = " << y
         << ", radius = " << r
         << ". Perimeter = " << Perimeter() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Circle::Perimeter() {
    return double(2 * M_PI * r);;
}
