//------------------------------------------------------------------------------
// circle.cpp - содержит функции обработки треугольника
//------------------------------------------------------------------------------

#include "circle.h"
#include "math.h"
#include <iostream>
//------------------------------------------------------------------------------
// Ввод параметров круга из потока
void In(circle &c, ifstream &ifst) {
    ifst >> c.x >> c.y >> c.r;
}

// Случайный ввод параметров круга
void InRnd(circle &c) {
    c.x = Random();
    c.y = Random();
    c.r = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров круга в поток
void Out(circle &c, ofstream &ofst) {
    ofst << "It is Circle: x = "
         << c.x << ", y = " << c.y
         << ", radius = " << c.r
         << ". Perimeter = " << Perimeter(c) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра круга
double Perimeter(circle &c) {
    return double(2 * M_PI * c.r);
}
